# SetStaticTextColor

## Description
Sets the color for the Layout Manager static Text

```pascal
PROCEDURE SetStaticTextColor(
				dialogID    : LONGINT;
				componentID : LONGINT;
				red         : INTEGER;
				green       : INTEGER;
				blue        : INTEGER);
```

```python

def vs.SetStaticTextColor(dialogID, componentID, red, green, blue):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT||
|componentID|LONGINT||
|red|INTEGER||
|green|INTEGER||
|blue|INTEGER||

## Version
Availability: from Vectorworks 2010
## Category
* Dialogs - Modern